Revit 2027 API
BuiltInFailures.MEPCalculationFailures.NetworkInconsistentDemandFlow Property
 The specified flow on this equipment is inconsistent with the other equipment in this branch. The branch flow is calculated based on the maximum specified value.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NetworkInconsistentDemandFlow { get; }
Public Shared ReadOnly Property NetworkInconsistentDemandFlow As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NetworkInconsistentDemandFlow {
	FailureDefinitionId^ get ();
}
static member NetworkInconsistentDemandFlow : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace